# NotBentDetailComponent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BendFailures..::..NotBentDetailComponent Property
BuiltInFailures..::..BendFailures Class See Also
---
While making curved beam type "[Type Name]" 2D Detail Component elements were not created
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotBentDetailComponent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotBentDetailComponent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotBentDetailComponent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BendFailures Class
Autodesk.Revit.DB Namespace